import java.util.ArrayList;

/**Створити класи (мінімум по 2 поля і одному методу), які дозволять описати наступні сутності:
        ЛЮДИНА, СОЛДАТ, КОМАНДИР, ГЕНЕРАЛ знаючи, що генерал, солдат і командир - це люди, при
        цьому від командира залежать 3 солдат, а від генерала 2 командира. Людина повинна імліментувати
        інтерфейс ЗДАТНИЙ_ДО_БОЙОВИХ_ДІЙ, який буде мати два методи: МОЖУ_ВОЮВАТИ і ДОПОВІДАТИ.
        Дані методи повинні викидати власне виключення, що перевірється. Створити штаб
        (в main методі один спільний масив) з 6 солдат, 2 командирів і генерала.
        Кожна особа повинна доповісти, у кого перебуває в підпорядкуванні і про можливість воювати
 */

public class Main {

    public static void main(String[] args) throws Ограничения{
        ArrayList<ЛЮДИНА> сборищеЛюдей = new ArrayList<ЛЮДИНА>();
        ГЕНЕРАЛ генерал = new ГЕНЕРАЛ("Брунов",55,true);
        КОМАНДИР командир1 = new КОМАНДИР("Кобяков",63,true);
        КОМАНДИР командир2 = new КОМАНДИР("Усик",34,true);
        генерал.добавитьВКоманду(командир1);
        генерал.добавитьВКоманду(командир2);
        сборищеЛюдей.add(генерал);
        сборищеЛюдей.add(командир1);
        сборищеЛюдей.add(командир2);

        for (int i = 1; i <= 3 ; i++) {
            СОЛДАТ солдат = new СОЛДАТ("Перепечкин"+i,23);
            командир1.добавитьВКоманду(солдат);
            сборищеЛюдей.add(солдат);
        }

        for (int i = 1; i <= 3 ; i++) {
            СОЛДАТ солдат = new СОЛДАТ("Булочкин"+i,25);
            командир2.добавитьВКоманду(солдат);
            сборищеЛюдей.add(солдат);
        }

        for (ЛЮДИНА чел:сборищеЛюдей){
            System.out.println(чел.ДОПОВІДАТИ());

        }



    }
}



